[
    {
      "id": 1,
      "title": "Personal Project Plan",
      "link": "./deliverbles/projectplan.php",
      "projectTypeIcon": "../assets/icons/personal_project.svg",
      "learningOutcomeA": "../assets/icons/lo4.svg",
      "learningOutcomeB": "../assets/icons/lo5.svg",
      "learningOutcomeC": "",
      "coverImage": "./assets/images/project-plan.png",
      "context": "The project plan describes the personal project, defines the scope, planning and research questions with the corresponding research methods. This Document was checked and approved by the semester coach (Bardt van der Dennen) before starting the project.",
      "results": "Through the project plan, I created an overview to know exactly what I was going to do in the first 3 weeks of the personal project. By creating the main question 'How to create a scalable portfolio to present the projects to stakeholders and teachers in a visually appealing way?' several sub-questions arose. Among them, 'How can users easily navigate through the portfolio?', 'How to make a portfolio scalable?' and 'How do I make a portfolio visually attractive?'. For each sub-question, the right research methods were chosen, allowing me to prepare for the research and make a groblal planning of how I wanted to organise the first weeks to get off to a good start. Through the scope, I indicated what I would finish these first three weeks and what I wouldn't.",
      "conclusion": "By drawing up a project plan, neither myself nor Bardt will face any surprises, because what is expected of me has already been checked in advance. The project plan also ensures an organised approach, making it easier to achieve the goal.",
      "documentLink": "../documents/projectplan_personal_project.pdf"
    },
      {
        "id": 2,
        "title": "Research - How can users easily navigate through the portfolio?",
        "link": "./deliverbles/research_navigation.php",
        "projectTypeIcon": "../assets/icons/personal_project.svg",
        "learningOutcomeA": "../assets/icons/lo1.svg",
        "learningOutcomeB": "../assets/icons/lo5.svg",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/research.png",
        "context": "This document describes all the research that answers the following sub- question 'How can users easily navigate through the portfolio?'. This research provides more clarity about who will use the portfolio and what options there are in terms of navigation. This research will contribute to creating a good user experience.",
        "results": "",
        "conclusion": "Through this research, I concluded that the target group is “above-average technical, English reading between 20 and 40 years old. I also know the different types of navigation that exist, and what the benefits are for each type. Through a conversation with people from the target group, I was able to conclude that the portfolio does not need a large menu structure. By knowing all this information, I can conclude that there are multiple options for navigation and there is no best navigation option, all options have their pros and cons. The horizontal, hamburger and full-screen navigation menus are the best options for this target group and this project. A later design test will reveal which menu option is best suited for this situation.",
        "documentLink": "../documents/research_navigation.pdf"
      },
      {
        "id": 3,
        "title": "Research - How to make a portfolio scalable?",
        "link": "./deliverbles/research_scalable.php",
        "projectTypeIcon": "../assets/icons/personal_project.svg",
        "learningOutcomeA": "../assets/icons/lo5.svg",
        "learningOutcomeB": "",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/research.png",
        "context": "This document describes all the research that answers the following sub-question 'How to make a portfolio scalable?'. This research provides more clarity about how the portfolio can be expanded, whether a framework is the best solution and which framework is best used.",
        "results": "",
        "conclusion": "Frameworks can have major advantages, allowing objects that repeat more often in the portfolio to be created faster and better, and they can also be adjusted more easily. The biggest disadvantage is that it takes more time to learn and understand how these frameworks work. For this reason, I chose not to use a framework and to realise this with Vanilla JavaScript only.",
        "documentLink": "../documents/research_scalable.pdf"
      },
      {
        "id": 4,
        "title": "Research - How do I make a portfolio visually attractive?",
        "link": "./deliverbles/research_visual.php",
        "projectTypeIcon": "../assets/icons/personal_project.svg",
        "learningOutcomeA": "../assets/icons/lo1.svg",
        "learningOutcomeB": "../assets/icons/lo2.svg",
        "learningOutcomeC": "../assets/icons/lo5.svg",
        "coverImage": "./assets/images/research.png",
        "context": "This document describes all the research that answers the following sub-question 'How do I make a portfolio visually attractive?'. This research provides more clarity about what the portfolio will look like visually so that it matches my personal style, the needs of the user and provides direction when creating the first designs.",
        "results": "",
        "conclusion": "Through this research, I was able to determine a direction for the design. This included considering the latest design trends and choosing an appropriate font, colour palette and navigation structure. By making several prototypes, I was able to determine which design works best. The results of the user test revealed improvements that could be made to the design. It has also given new insights that can be added for a better user experience.",
        "documentLink": "../documents/research_visual.pdf"
      }
    
  ]