[
    {
      "id": 1,
      "title": "Personal Project Plan",
      "link": "./deliverbles/projectplan.html",
      "projectTypeIcon": "../assets/icons/personal_project.svg",
      "learningOutcomeA": "../assets/icons/lo4.svg",
      "learningOutcomeB": "../assets/icons/lo5.svg",
      "learningOutcomeC": "",
      "coverImage": "./assets/images/personal-project-plan.jpg",
      "pageImage": "../assets/images/personal-project-plan.jpg",
      "context": "The project plan describes the personal project, defines the scope, planning and research questions with the corresponding research methods. This Document was checked and approved by the semester coach (Bardt van der Dennen) before starting the project.",
      "results": "Through the project plan, I created an overview to know exactly what I was going to do in the first 3 weeks of the personal project. By creating the main question 'How to create a scalable portfolio to present the projects to stakeholders and teachers in a visually appealing way?' several sub-questions arose. Among them, 'How can users easily navigate through the portfolio?', 'How to make a portfolio scalable?' and 'How do I make a portfolio visually attractive?'. For each sub-question, the right research methods were chosen, allowing me to prepare for the research and make a groblal planning of how I wanted to organise the first weeks to get off to a good start. Through the scope, I indicated what I would finish these first three weeks and what I wouldn't.",
      "conclusion": "By drawing up a project plan, neither myself nor Bardt will face any surprises, because what is expected of me has already been checked in advance. The project plan also ensures an organised approach, making it easier to achieve the goal.",
      "documentLink": "../documents/projectplan_personal_project.pdf"
    },
      {
        "id": 2,
        "title": "Research - How can users easily navigate through the portfolio?",
        "link": "./deliverbles/research_navigation.html",
        "projectTypeIcon": "../assets/icons/personal_project.svg",
        "learningOutcomeA": "../assets/icons/lo1.svg",
        "learningOutcomeB": "../assets/icons/lo5.svg",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/research-navigation.jpg",
        "pageImage": "../assets/images/research-navigation.jpg",
        "context": "This document describes all the research that answers the following sub- question 'How can users easily navigate through the portfolio?'. This research provides more clarity about who will use the portfolio and what options there are in terms of navigation. This research will contribute to creating a good user experience.",
        "results": "",
        "conclusion": "Through this research, I concluded that the target group is “above-average technical, English reading between 20 and 40 years old. I also know the different types of navigation that exist, and what the benefits are for each type. Through a conversation with people from the target group, I was able to conclude that the portfolio does not need a large menu structure. By knowing all this information, I can conclude that there are multiple options for navigation and there is no best navigation option, all options have their pros and cons. The horizontal, hamburger and full-screen navigation menus are the best options for this target group and this project. A later design test will reveal which menu option is best suited for this situation.",
        "documentLink": "../documents/research_navigation.pdf"
      },
      {
        "id": 3,
        "title": "Research - How to make a portfolio scalable?",
        "link": "./deliverbles/research_scalable.html",
        "projectTypeIcon": "../assets/icons/personal_project.svg",
        "learningOutcomeA": "../assets/icons/lo5.svg",
        "learningOutcomeB": "",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/research-scalable.jpg",
        "pageImage": "../assets/images/research-scalable.jpg",
        "context": "This document describes all the research that answers the following sub-question 'How to make a portfolio scalable?'. This research provides more clarity about how the portfolio can be expanded, whether a framework is the best solution and which framework is best used.",
        "results": "",
        "conclusion": "Frameworks can have major advantages, allowing objects that repeat more often in the portfolio to be created faster and better, and they can also be adjusted more easily. The biggest disadvantage is that it takes more time to learn and understand how these frameworks work. For this reason, I chose not to use a framework and to realise this with Vanilla JavaScript only.",
        "documentLink": "../documents/research_scalable.pdf"
      },
      {
        "id": 4,
        "title": "Research - How do I make a portfolio visually attractive?",
        "link": "./deliverbles/research_visual.html",
        "projectTypeIcon": "../assets/icons/personal_project.svg",
        "learningOutcomeA": "../assets/icons/lo1.svg",
        "learningOutcomeB": "../assets/icons/lo2.svg",
        "learningOutcomeC": "../assets/icons/lo5.svg",
        "coverImage": "./assets/images/research-visual.jpg",
        "pageImage": "../assets/images/research-visual.jpg",
        "context": "This document describes all the research that answers the following sub-question 'How do I make a portfolio visually attractive?'. This research provides more clarity about what the portfolio will look like visually so that it matches my personal style, the needs of the user and provides direction when creating the first designs.",
        "results": "",
        "conclusion": "Through this research, I was able to determine a direction for the design. This included considering the latest design trends and choosing an appropriate font, colour palette and navigation structure. By making several prototypes, I was able to determine which design works best. The results of the user test revealed improvements that could be made to the design. It has also given new insights that can be added for a better user experience.",
        "documentLink": "../documents/research_visual.pdf"
      },
      {
        "id": 5,
        "title": "Group Project Plan",
        "link": "./deliverbles/group_projectplan.html",
        "projectTypeIcon": "../assets/icons/group_project.svg",
        "learningOutcomeA": "../assets/icons/lo4.svg",
        "learningOutcomeB": "../assets/icons/lo5.svg",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/group-project-plan.jpg",
        "pageImage": "../assets/images/group-project-plan.jpg",
        "context": "The project plan describes the group project, defines the scope, planning and research questions with the corresponding research methods. This Document was checked and approved by the semester coach (Bardt van der Dennen) and stakeholder (Dennis Kirsch) before starting the project.",
        "results": "Through the project plan, We created an overview to know exactly what we where going to do during the 12 weeks of the group project. By creating the main question 'How can we use a smartphone app to give insights to young exercise teachers on hearing damage caused by loud noises during PE lessons?' several sub-questions arose. Among them, 'In what way can we visualize data in order to make sure it is insightful for our target audience?', 'What type of data will help the user become completely aware of potential hearing damage?' and 'How can we test the UI/UX of the app?'. For each sub-question, the right research methods were chosen, allowing me to prepare for the research and make a groblal planning of how we wanted to organise to get off to a good start. Through the scope, we indicated what we would make and what we wouldn't.",
        "conclusion": "By writing the project plan, neither our group and stakeholder will not face any surprises, because what is expected of us has already been checked in advance. The project plan also ensures an organised approach, making it easier to achieve the goal.",
        "documentLink": "../documents/projectplan_group2_1.3.pdf"
      },
      {
        "id": 6,
        "title": "Products & Craft Design",
        "link": "./deliverbles/products&craftdesign.html",
        "projectTypeIcon": "../assets/icons/international_project.svg",
        "learningOutcomeA": "../assets/icons/lo7.svg",
        "learningOutcomeB": "",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/product&craftdesign.jpg",
        "pageImage": "../assets/images/product&craftdesign.jpg",
        "context": "During this project, we visited Dutch Design Week and collaborated with students from Humber College, Toronto (Canada). The goal was to get inspired by the different exhibitions and come up with a creative concept for the narrative 'Products & Craft Design'.",
        "results": "We spent the first 2 days of Dutch Design Week walking around and looking at the exhibitions for inspiration. On the 3rd day, we threw together all the photos we had taken and things that have remained with us. we noticed that many of the projects we had seen were on sustainable topics. For this reason, we were going to think of a product that we might see at next year's Dutch Design Week. We came up with the following concept 'Bag2Nature', a bag made of natural waste such as orange peel. We made a paper prototype of this idea which we could use to visually reinforce our pitch video.",
        "conclusion": "During this project, we had a short time to get to know the international student, which we immediately started working with. The communication was easy, and we were able to create a nice concept in just one day.",
        "documentLink": "../documents/products&craftdesign.pdf"
      },
      {
        "id": 7,
        "title": "UX/UI Design Trends",
        "link": "./deliverbles/ux_ui_design_trends.html",
        "projectTypeIcon": "../assets/icons/group_project.svg",
        "learningOutcomeA": "../assets/icons/lo1.svg",
        "learningOutcomeB": "../assets/icons/lo5.svg",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/ux_ui_design_trends.jpg",
        "pageImage": "../assets/images/ux_ui_design_trends.jpg",
        "context": "This document answers the sub-question 'How can the app's UX/UI be optimised for both Apple and Android users?' This research documentlooks at UX/UI trends for mobile apps through trend analysis. Incorporating these trends into our own app design will improve the user experience and put you one step ahead of competitors.",
        "results": "",
        "conclusion": "The results of the trend analysis were not very innovative the use of darkmode, minimalism and bottom navigation are well-known elements that we would have already applied without this research. However, some lesser-known trends such as neumorphism and glassmorphism also emerged. These trends can be included in the design of the prototypes.",
        "documentLink": "../documents/ux_ui_design_trends.pdf"
      },
      {
        "id": 8,
        "title": "UX/UI Testing Methods",
        "link": "./deliverbles/ux_ui_testing_methods.html",
        "projectTypeIcon": "../assets/icons/group_project.svg",
        "learningOutcomeA": "../assets/icons/lo5.svg",
        "learningOutcomeB": "",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/ux_ui_testing_methods.jpg",
        "pageImage": "../assets/images/ux_ui_testing_methods.jpg",
        "context": "This document answers the sub-question 'How can we test the UX/UI of the app?' In this research document, the most relevant testing methods for the 'grip on sound' project are discussed.",
        "results": "",
        "conclusion": "",
        "documentLink": "../documents/ux_ui_design_trends.pdf"
      },
      {
        "id": 9,
        "title": "MoSCoW Method",
        "link": "./deliverbles/moscow_method.html",
        "projectTypeIcon": "../assets/icons/group_project.svg",
        "learningOutcomeA": "../assets/icons/lo1.svg",
        "learningOutcomeB": "",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/moscow_method.jpg",
        "pageImage": "../assets/images/moscow_method.jpg",
        "context": "To know which requirements should be reflected in the design, we added up a Requirements List. As not all items are equally important, we used the MoSCoW method to divide up the requirements.",
        "results": "",
        "conclusion": "By drawing up the requirements list, it becomes clear which technical and functional requirements belong in app. The MoSCoW method gives a good picture for which components are most important.",
        "documentLink": "../documents/moscow_method.pdf"
      },
      {
        "id": 10,
        "title": "Portfolio Development",
        "link": "./deliverbles/portfolio_development.html",
        "projectTypeIcon": "../assets/icons/personal_project.svg",
        "learningOutcomeA": "../assets/icons/lo3.svg",
        "learningOutcomeB": "",
        "learningOutcomeC": "",
        "coverImage": "./assets/images/portfolio_development.jpg",
        "pageImage": "../assets/images/portfolio_development.jpg",
        "context": "To know which requirements should be reflected in the design, we added up a Requirements List. As not all items are equally important, we used the MoSCoW method to divide up the requirements.",
        "results": "",
        "conclusion": "By drawing up the requirements list, it becomes clear which technical and functional requirements belong in app. The MoSCoW method gives a good picture for which components are most important.",
        "documentLink": "../documents/portfolio_development.pdf"
      }
  ]